Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/working_in_ireland/index.html.txt.tmx
Source language: en
Languages: ga

source: Coming to work in Ireland
ga: Ag teacht go hÉirinn chun oibriú

source: The rights of EU nationals and non-EU nationals to work in Ireland and includes information on how to apply for an employment permit
ga: Ceart na náisiúnach AE agus na náisiúnach neamh-AE chun oibriú in Éirinn. Áirítear faisnéis ar conas iarratas a dhéanamh ar chead fostaíochta

source: Find out about General Employment Permits, who may apply and when a person with an employment permit may change jobs
ga: Faigh amach faoi Cheadanna Fostaíochta Ginearálta, cé atá i dteideal iarratas a dhéanamh agus cá huair is féidir le duine a bhfuil cead oibre aige poist a mhalartú

source: This document is in: Employment > Migrant workers > Employment permits
ga: This document is in: Fostaíocht > Oibrithe imirceacha > Ceadanna fostaíochta

source: Coming from the EU/EEA to work
ga: Ag teacht ón AE/LEE chun oibriú

source: Details the rights of EU/EEA nationals to come to Ireland to work, and covers rights while working
ga: Cur síos ar cheart na náisiúnach AE agus na náisiúnach neamh-AE chun oibriú in Éirinn agus áirítear a gcearta fhostaíochta

source: In addition deals with the entitlements of Irish citizens returning to Ireland particularly if unemployed
ga: Ina theannta sin leagtar amach agus áirítear teidlíochtaí saoránach Éireannaigh a thagann ar ais in Éirinn, go háirithe na daoine dífhostaithe

source: This document is in: Employment > Migrant workers
ga: This document is in: Fostaíocht > Oibrithe imirceacha

source: Details of the arrangements to give access to employment for spouses, partners and dependants of non-EEA nationals who are holders of Critical Skills Employment Permits and researchers
ga: Mionsonraí na socruithe le teacht ar fhostaíocht a dhéanamh do chéilí, do pháirtnéirí agus do chleithiúnaigh shaoránaigh neamh-LEE atá ina sealbhóirí Ceada Fostaíochta Scileanna Ríthábhachtacha nó taighdeoirí

source: Critical Skills Employment Permit
ga: Cead Fostaíochta Scileanna Ríthábhachtacha

source: The Critical Skills Employment Permit is an employment permit for employees in designated categories, depending on salary level
ga: Is cead fostaíochta é Cead Fostaíochta Scileanna Ríthábhachtacha d'fhostaithe i gcatagóirí ainmnithe, ag brath ar leibhéal an tuarastail

source: Further and higher education qualifications
ga: Cáilíochtaí ardoideachais agus oideachais leanúnaigh

source: The system of validation of qualifications in further and higher education
ga: An córas aitheantais atá ann do cháilíochtaí

source: This document is in: Education and Training > Third-level education > Colleges and qualifications
ga: This document is in: Oideachas agus Oiliúint > Oideachas tríú leibhéil > Coláistí agus Cáilíochtaí

source: Finding a job in Ireland
ga: Post a fháil in Éirinn

source: Information for EEA nationals and non-EEA nationals about how to look for employment in Ireland
ga: Cuireann an doiciméad seo faisnéis ar fáil do náisiúnaigh LEE agus náisiúnaigh neamh-LEE faoi conas fostaíócht a fháil in Éirinn

source: Coming to Ireland - tax and social insurance
ga: Ag teacht go hÉirinn - cáin agus ÁSPC

source: Important information for those coming to work in Ireland about tax issues of residence, domicile, double taxation, income earned prior to moving, and temporary employment in Ireland
ga: Ag teacht go hÉirinn le dul ag obair anseo; cáin, áit chónaithe, áit sainchónithe, cánachas dúbailte, ioncam a saoraíodh roimh theacht go hÉirinn agus fostaíocht sealadach in Éirinn

source: Coming to set up a business or invest in Ireland
ga: Teacht go hÉirinn le infheistiú nó gnó a chur ar bun

source: Information for foreign nationals on the immigrant investor, entrepreneur and business permission schemes
ga: Faisnéis do náisiúnaigh choigríche, a áiríonn faisnéis faoi na scéimeanna inimircigh d’infheisteora, fiontraí agus chead gnó

source: This document is in: Employment > Types of employment > Self-employment
ga: This document is in: Fostaíocht > Cineálacha Fostaíochta > Féinfhostaíocht

source: Most Read in "Moving Country"
ga: Ábhar is mó éilimh i "Ag bogadh tíre"

source: Irish citizenship through birth or descent
ga: Saoránacht d'Éirinn ó bhreith nó ó ghinealach

source: Visa requirements for entering Ireland
ga: Riachtanais víosa le teacht isteach in Éirinn

source: Becoming an Irish citizen
ga: Ag éirí i do shaoránach Éireannach
